[
    {
        "name": "广州",
        "list": [
            {
                "name": "广州欢乐世界"
            },
            {
                "name": "广州野生动物世界"
            },
            {
                "name": "广州水上乐园"
            },
            {
                "name": "广州国际大马戏"
            }
        ]
    },
    {
        "name": "珠海",
        "list": [
            {
                "name": "珠海长隆海洋王国"
            },
            {
                "name": "珠海长隆横琴国际马戏城"
            }
        ]
    }
]